GopalSaraf/Practicals/PSDL/include/proc/pic18f14k50.inc
// Register: PCL
#define PCL PCL
PCL                                      equ 0FF9h

// Register: PCLATH
#define PCLATH PCLATH
PCLATH                                   equ 0FFAh

// Register: PCLATU
#define PCLATU PCLATU
PCLATU                                   equ 0FFBh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 0FFCh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh
STKPTR_STKUNF_POSN                       equ 0006h
STKPTR_STKUNF_POSITION                   equ 0006h
STKPTR_STKUNF_SIZE                       equ 0001h
STKPTR_STKUNF_LENGTH                     equ 0001h
STKPTR_STKUNF_MASK                       equ 0040h
STKPTR_STKFUL_POSN                       equ 0007h
STKPTR_STKFUL_POSITION                   equ 0007h
STKPTR_STKFUL_SIZE                       equ 0001h
STKPTR_STKFUL_LENGTH                     equ 0001h
STKPTR_STKFUL_MASK                       equ 0080h
STKPTR_SP0_POSN                          equ 0000h
STKPTR_SP0_POSITION                      equ 0000h
STKPTR_SP0_SIZE                          equ 0001h
STKPTR_SP0_LENGTH                        equ 0001h
STKPTR_SP0_MASK                          equ 0001h
STKPTR_SP1_POSN                          equ 0001h
STKPTR_SP1_POSITION                      equ 0001h
STKPTR_SP1_SIZE                          equ 0001h
STKPTR_SP1_LENGTH                        equ 0001h
STKPTR_SP1_MASK                          equ 0002h
STKPTR_SP2_POSN                          equ 0002h
STKPTR_SP2_POSITION                      equ 0002h
STKPTR_SP2_SIZE                          equ 0001h
STKPTR_SP2_LENGTH                        equ 0001h
STKPTR_SP2_MASK                          equ 0004h
STKPTR_SP3_POSN                          equ 0003h
STKPTR_SP3_POSITION                      equ 0003h
STKPTR_SP3_SIZE                          equ 0001h
STKPTR_SP3_LENGTH                        equ 0001h
STKPTR_SP3_MASK                          equ 0008h
STKPTR_SP4_POSN                          equ 0004h
STKPTR_SP4_POSITION                      equ 0004h
STKPTR_SP4_SIZE                          equ 0001h
STKPTR_SP4_LENGTH                        equ 0001h
STKPTR_SP4_MASK                          equ 0010h
STKPTR_STKOVF_POSN                       equ 0007h
STKPTR_STKOVF_POSITION                   equ 0007h
STKPTR_STKOVF_SIZE                       equ 0001h
STKPTR_STKOVF_LENGTH                     equ 0001h
STKPTR_STKOVF_MASK                       equ 0080h

// Register: TOS
#define TOS TOS
TOS                                      equ 0FFDh

// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FFDh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FFEh

// Register: TOSU
#define TOSU TOSU
TOSU                                     equ 0FFFh

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 0FFFFFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 0FFh)
#endif
#define ABDEN                            BANKMASK(BAUDCON), 0, a
#define ABDOVF                           BANKMASK(BAUDCON), 7, a
#define ACKDT                            BANKMASK(SSPCON2), 5, a
#define ACKEN                            BANKMASK(SSPCON2), 4, a
#define ACKSTAT                          BANKMASK(SSPCON2), 6, a
#define ACQT0                            BANKMASK(ADCON2), 3, a
#define ACQT1                            BANKMASK(ADCON2), 4, a
#define ACQT2                            BANKMASK(ADCON2), 5, a
#define ACTVIE                           BANKMASK(UIE), 2, a
#define ACTVIF                           BANKMASK(UIR), 2, a
#define ADCS0                            BANKMASK(ADCON2), 0, a
#define ADCS1                            BANKMASK(ADCON2), 1, a
#define ADCS2                            BANKMASK(ADCON2), 2, a
#define ADDEN                            BANKMASK(RCSTA), 3, a
#define ADDR0                            BANKMASK(UADDR), 0, b
#define ADDR1                            BANKMASK(UADDR), 1, b
#define ADDR2                            BANKMASK(UADDR), 2, b
#define ADDR3                            BANKMASK(UADDR), 3, b
#define ADDR4                            BANKMASK(UADDR), 4, b
#define ADDR5                            BANKMASK(UADDR), 5, b
#define ADDR6                            BANKMASK(UADDR), 6, b
#define ADEN                             BANKMASK(RCSTA), 3, a
#define ADFM                             BANKMASK(ADCON2), 7, a
#define ADIE                             BANKMASK(PIE1), 6, a
#define ADIF                             BANKMASK(PIR1), 6, a
#define ADIP                             BANKMASK(IPR1), 6, a
#define ADON                             BANKMASK(ADCON0), 0, a
#define AN10                             BANKMASK(PORTB), 4, a
#define AN11                             BANKMASK(PORTB), 5, a
#define AN3                              BANKMASK(PORTA), 4, a
#define AN4                              BANKMASK(PORTC), 0, a
#define AN5                              BANKMASK(PORTC), 1, a
#define AN6                              BANKMASK(PORTC), 2, a
#define AN7                              BANKMASK(PORTC), 3, a
#define AN8                              BANKMASK(PORTC), 6, a
#define AN9                              BANKMASK(PORTC), 7, a
#define ANS10                            BANKMASK(ANSELH), 2, a
#define ANS11                            BANKMASK(ANSELH), 3, a
#define ANS3                             BANKMASK(ANSEL), 3, a
#define ANS4                             BANKMASK(ANSEL), 4, a
#define ANS5                             BANKMASK(ANSEL), 5, a
#define ANS6                             BANKMASK(ANSEL), 6, a
#define ANS7                             BANKMASK(ANSEL), 7, a
#define ANS8                             BANKMASK(ANSELH), 0, a
#define ANS9                             BANKMASK(ANSELH), 1, a
#define BCLIE                            BANKMASK(PIE2), 3, a
#define BCLIF                            BANKMASK(PIR2), 3, a
#define BCLIP                            BANKMASK(IPR2), 3, a
#define BF                               BANKMASK(SSPSTAT), 0, a
#define BOR                              BANKMASK(RCON), 0, a
#define BRG16                            BANKMASK(BAUDCON), 3, a
#define BRGH                             BANKMASK(TXSTA), 2, a
#define BRGH1                            BANKMASK(TXSTA), 2, a
#define BTOEE                            BANKMASK(UEIE), 4, b
#define BTOEF                            BANKMASK(UEIR), 4, b
#define BTSEE                            BANKMASK(UEIE), 7, b
#define BTSEF                            BANKMASK(UEIR), 7, b
#define C12IN1M                          BANKMASK(PORTC), 1, a
#define C12IN2M                          BANKMASK(PORTC), 2, a
#define C12IN3M                          BANKMASK(PORTC), 3, a
#define C12INP                           BANKMASK(PORTC), 0, a
#define C12OUT                           BANKMASK(PORTC), 4, a
#define C1CH0                            BANKMASK(CM1CON0), 0, a
#define C1CH1                            BANKMASK(CM1CON0), 1, a
#define C1HYS                            BANKMASK(CM2CON1), 3, a
#define C1IE                             BANKMASK(PIE2), 6, a
#define C1IF                             BANKMASK(PIR2), 6, a
#define C1IP                             BANKMASK(IPR2), 6, a
#define C1OE                             BANKMASK(CM1CON0), 5, a
#define C1ON                             BANKMASK(CM1CON0), 7, a
#define C1OUT                            BANKMASK(CM1CON0), 6, a
#define C1POL                            BANKMASK(CM1CON0), 4, a
#define C1R                              BANKMASK(CM1CON0), 2, a
#define C1RSEL                           BANKMASK(CM2CON1), 5, a
#define C1SP                             BANKMASK(CM1CON0), 3, a
#define C1SYNC                           BANKMASK(CM2CON1), 1, a
#define C2CH0                            BANKMASK(CM2CON0), 0, a
#define C2CH1                            BANKMASK(CM2CON0), 1, a
#define C2HYS                            BANKMASK(CM2CON1), 2, a
#define C2IE                             BANKMASK(PIE2), 5, a
#define C2IF                             BANKMASK(PIR2), 5, a
#define C2IP                             BANKMASK(IPR2), 5, a
#define C2OE                             BANKMASK(CM2CON0), 5, a
#define C2ON                             BANKMASK(CM2CON0), 7, a
#define C2OUT                            BANKMASK(CM2CON0), 6, a
#define C2POL                            BANKMASK(CM2CON0), 4, a
#define C2R                              BANKMASK(CM2CON0), 2, a
#define C2RSEL                           BANKMASK(CM2CON1), 4, a
#define C2SP                             BANKMASK(CM2CON0), 3, a
#define C2SYNC                           BANKMASK(CM2CON1), 0, a
#define CARRY                            BANKMASK(STATUS), 0, a
#define CCP1                             BANKMASK(PORTC), 5, a
#define CCP1IE                           BANKMASK(PIE1), 2, a
#define CCP1IF                           BANKMASK(PIR1), 2, a
#define CCP1IP                           BANKMASK(IPR1), 2, a
#define CCP1M0                           BANKMASK(CCP1CON), 0, a
#define CCP1M1                           BANKMASK(CCP1CON), 1, a
#define CCP1M2                           BANKMASK(CCP1CON), 2, a
#define CCP1M3                           BANKMASK(CCP1CON), 3, a
#define CCP2                             BANKMASK(PORTC), 1, a
#define CFGS                             BANKMASK(EECON1), 6, a
#define CHS0                             BANKMASK(ADCON0), 2, a
#define CHS1                             BANKMASK(ADCON0), 3, a
#define CHS2                             BANKMASK(ADCON0), 4, a
#define CHS3                             BANKMASK(ADCON0), 5, a
#define CHSN3                            BANKMASK(ADCON1), 3, a
#define CK                               BANKMASK(PORTB), 7, a
#define CKE                              BANKMASK(SSPSTAT), 6, a
#define CKP                              BANKMASK(SSPCON1), 4, a
#define CKTXP                            BANKMASK(BAUDCON), 4, a
#define CLKIN                            BANKMASK(PORTA), 5, a
#define CLKOUT                           BANKMASK(PORTA), 4, a
#define CMIE                             BANKMASK(PIE2), 6, a
#define CMIF                             BANKMASK(PIR2), 6, a
#define CMIP                             BANKMASK(IPR2), 6, a
#define CRC16EE                          BANKMASK(UEIE), 2, b
#define CRC16EF                          BANKMASK(UEIR), 2, b
#define CRC5EE                           BANKMASK(UEIE), 1, b
#define CRC5EF                           BANKMASK(UEIR), 1, b
#define CREN                             BANKMASK(RCSTA), 4, a
#define CSRC                             BANKMASK(TXSTA), 7, a
#define CSRC1                            BANKMASK(TXSTA), 7, a
#define CVREF                            BANKMASK(PORTC), 2, a
#define D1EN                             BANKMASK(REFCON1), 7, a
#define D1LPS                            BANKMASK(REFCON1), 6, a
#define D1NSS                            BANKMASK(REFCON1), 0, a
#define D1NSS0                           BANKMASK(REFCON1), 0, a
#define D1PSS0                           BANKMASK(REFCON1), 2, a
#define D1PSS1                           BANKMASK(REFCON1), 3, a
#define DA                               BANKMASK(SSPSTAT), 5, a
#define DAC1OE                           BANKMASK(REFCON1), 5, a
#define DAC1R0                           BANKMASK(REFCON2), 0, a
#define DAC1R1                           BANKMASK(REFCON2), 1, a
#define DAC1R2                           BANKMASK(REFCON2), 2, a
#define DAC1R3                           BANKMASK(REFCON2), 3, a
#define DAC1R4                           BANKMASK(REFCON2), 4, a
#define DC                               BANKMASK(STATUS), 1, a
#define DC1B0                            BANKMASK(CCP1CON), 4, a
#define DC1B1                            BANKMASK(CCP1CON), 5, a
#define DFN8EE                           BANKMASK(UEIE), 3, b
#define DFN8EF                           BANKMASK(UEIR), 3, b
#define DIR                              BANKMASK(USTAT), 2, a
#define DONE                             BANKMASK(ADCON0), 1, a
#define DT                               BANKMASK(PORTB), 5, a
#define DTRXP                            BANKMASK(BAUDCON), 5, a
#define D_A                              BANKMASK(SSPSTAT), 5, a
#define D_NOT_A                          BANKMASK(SSPSTAT), 5, a
#define D_nA                             BANKMASK(SSPSTAT), 5, a
#define EBDIS                            BANKMASK(PR2), 7, a
#define ECCPAS0                          BANKMASK(ECCP1AS), 4, a
#define ECCPAS1                          BANKMASK(ECCP1AS), 5, a
#define ECCPAS2                          BANKMASK(ECCP1AS), 6, a
#define ECCPASE                          BANKMASK(ECCP1AS), 7, a
#define EEADR0                           BANKMASK(EEADR), 0, a
#define EEADR1                           BANKMASK(EEADR), 1, a
#define EEADR2                           BANKMASK(EEADR), 2, a
#define EEADR3                           BANKMASK(EEADR), 3, a
#define EEADR4                           BANKMASK(EEADR), 4, a
#define EEADR5                           BANKMASK(EEADR), 5, a
#define EEADR6                           BANKMASK(EEADR), 6, a
#define EEADR7                           BANKMASK(EEADR), 7, a
#define EEFS                             BANKMASK(EECON1), 6, a
#define EEIE                             BANKMASK(PIE2), 4, a
#define EEIF                             BANKMASK(PIR2), 4, a
#define EEIP                             BANKMASK(IPR2), 4, a
#define EEPGD                            BANKMASK(EECON1), 7, a
#define ENDP0                            BANKMASK(USTAT), 3, a
#define ENDP1                            BANKMASK(USTAT), 4, a
#define ENDP2                            BANKMASK(USTAT), 5, a
#define ENDP3                            BANKMASK(USTAT), 6, a
#define EP0CONDIS                        BANKMASK(UEP0), 3, b
#define EP0HSHK                          BANKMASK(UEP0), 4, b
#define EP0INEN                          BANKMASK(UEP0), 1, b
#define EP0OUTEN                         BANKMASK(UEP0), 2, b
#define EP0STALL                         BANKMASK(UEP0), 0, b
#define EP1CONDIS                        BANKMASK(UEP1), 3, b
#define EP1HSHK                          BANKMASK(UEP1), 4, b
#define EP1INEN                          BANKMASK(UEP1), 1, b
#define EP1OUTEN                         BANKMASK(UEP1), 2, b
#define EP1STALL                         BANKMASK(UEP1), 0, b
#define EP2CONDIS                        BANKMASK(UEP2), 3, b
#define EP2HSHK                          BANKMASK(UEP2), 4, b
#define EP2INEN                          BANKMASK(UEP2), 1, b
#define EP2OUTEN                         BANKMASK(UEP2), 2, b
#define EP2STALL                         BANKMASK(UEP2), 0, b
#define EP3CONDIS                        BANKMASK(UEP3), 3, b
#define EP3HSHK                          BANKMASK(UEP3), 4, b
#define EP3INEN                          BANKMASK(UEP3), 1, b
#define EP3OUTEN                         BANKMASK(UEP3), 2, b
#define EP3STALL                         BANKMASK(UEP3), 0, b
#define EP4CONDIS                        BANKMASK(UEP4), 3, b
#define EP4HSHK                          BANKMASK(UEP4), 4, b
#define EP4INEN                          BANKMASK(UEP4), 1, b
#define EP4OUTEN                         BANKMASK(UEP4), 2, b
#define EP4STALL                         BANKMASK(UEP4), 0, b
#define EP5CONDIS                        BANKMASK(UEP5), 3, b
#define EP5HSHK                          BANKMASK(UEP5), 4, b
#define EP5INEN                          BANKMASK(UEP5), 1, b
#define EP5OUTEN                         BANKMASK(UEP5), 2, b
#define EP5STALL                         BANKMASK(UEP5), 0, b
#define EP6CONDIS                        BANKMASK(UEP6), 3, b
#define EP6HSHK                          BANKMASK(UEP6), 4, b
#define EP6INEN                          BANKMASK(UEP6), 1, b
#define EP6OUTEN                         BANKMASK(UEP6), 2, b
#define EP6STALL                         BANKMASK(UEP6), 0, b
#define EP7CONDIS                        BANKMASK(UEP7), 3, b
#define EP7HSHK                          BANKMASK(UEP7), 4, b
#define EP7INEN                          BANKMASK(UEP7), 1, b
#define EP7OUTEN                         BANKMASK(UEP7), 2, b
#define EP7STALL                         BANKMASK(UEP7), 0, b
#define EPCONDIS                         BANKMASK(UEP0), 3, b
#define EPCONDIS0                        BANKMASK(UEP0), 3, b
#define EPCONDIS1                        BANKMASK(UEP1), 3, b
#define EPCONDIS2                        BANKMASK(UEP2), 3, b
#define EPCONDIS3                        BANKMASK(UEP3), 3, b
#define EPCONDIS4                        BANKMASK(UEP4), 3, b
#define EPCONDIS5                        BANKMASK(UEP5), 3, b
#define EPCONDIS6                        BANKMASK(UEP6), 3, b
#define EPCONDIS7                        BANKMASK(UEP7), 3, b
#define EPHSHK                           BANKMASK(UEP0), 4, b
#define EPHSHK0                          BANKMASK(UEP0), 4, b
#define EPHSHK1                          BANKMASK(UEP1), 4, b
#define EPHSHK2                          BANKMASK(UEP2), 4, b
#define EPHSHK3                          BANKMASK(UEP3), 4, b
#define EPHSHK4                          BANKMASK(UEP4), 4, b
#define EPHSHK5                          BANKMASK(UEP5), 4, b
#define EPHSHK6                          BANKMASK(UEP6), 4, b
#define EPHSHK7                          BANKMASK(UEP7), 4, b
#define EPINEN                           BANKMASK(UEP0), 1, b
#define EPINEN0                          BANKMASK(UEP0), 1, b
#define EPINEN1                          BANKMASK(UEP1), 1, b
#define EPINEN2                          BANKMASK(UEP2), 1, b
#define EPINEN3                          BANKMASK(UEP3), 1, b
#define EPINEN4                          BANKMASK(UEP4), 1, b
#define EPINEN5                          BANKMASK(UEP5), 1, b
#define EPINEN6                          BANKMASK(UEP6), 1, b
#define EPINEN7                          BANKMASK(UEP7), 1, b
#define EPOUTEN                          BANKMASK(UEP0), 2, b
#define EPOUTEN0                         BANKMASK(UEP0), 2, b
#define EPOUTEN1                         BANKMASK(UEP1), 2, b
#define EPOUTEN2                         BANKMASK(UEP2), 2, b
#define EPOUTEN3                         BANKMASK(UEP3), 2, b
#define EPOUTEN4                         BANKMASK(UEP4), 2, b
#define EPOUTEN5                         BANKMASK(UEP5), 2, b
#define EPOUTEN6                         BANKMASK(UEP6), 2, b
#define EPOUTEN7                         BANKMASK(UEP7), 2, b
#define EPSTALL                          BANKMASK(UEP0), 0, b
#define EPSTALL0                         BANKMASK(UEP0), 0, b
#define EPSTALL1                         BANKMASK(UEP1), 0, b
#define EPSTALL2                         BANKMASK(UEP2), 0, b
#define EPSTALL3                         BANKMASK(UEP3), 0, b
#define EPSTALL4                         BANKMASK(UEP4), 0, b
#define EPSTALL5                         BANKMASK(UEP5), 0, b
#define EPSTALL6                         BANKMASK(UEP6), 0, b
#define EPSTALL7                         BANKMASK(UEP7), 0, b
#define FERR                             BANKMASK(RCSTA), 2, a
#define FREE                             BANKMASK(EECON1), 4, a
#define FRM0                             BANKMASK(UFRML), 0, b
#define FRM1                             BANKMASK(UFRML), 1, b
#define FRM10                            BANKMASK(UFRMH), 2, b
#define FRM2                             BANKMASK(UFRML), 2, b
#define FRM3                             BANKMASK(UFRML), 3, b
#define FRM4                             BANKMASK(UFRML), 4, b
#define FRM5                             BANKMASK(UFRML), 5, b
#define FRM6                             BANKMASK(UFRML), 6, b
#define FRM7                             BANKMASK(UFRML), 7, b
#define FRM8                             BANKMASK(UFRMH), 0, b
#define FRM9                             BANKMASK(UFRMH), 1, b
#define FSEN                             BANKMASK(UCFG), 2, a
#define FVR1EN                           BANKMASK(REFCON0), 7, a
#define FVR1S0                           BANKMASK(REFCON0), 4, a
#define FVR1S1                           BANKMASK(REFCON0), 5, a
#define FVR1ST                           BANKMASK(REFCON0), 6, a
#define GCEN                             BANKMASK(SSPCON2), 7, a
#define GIE                              BANKMASK(INTCON), 7, a
#define GIEH                             BANKMASK(INTCON), 7, a
#define GIEL                             BANKMASK(INTCON), 6, a
#define GIE_GIEH                         BANKMASK(INTCON), 7, a
#define GO                               BANKMASK(ADCON0), 1, a
#define GODONE                           BANKMASK(ADCON0), 1, a
#define GO_DONE                          BANKMASK(ADCON0), 1, a
#define GO_NOT_DONE                      BANKMASK(ADCON0), 1, a
#define GO_nDONE                         BANKMASK(ADCON0), 1, a
#define HFIOFL                           BANKMASK(OSCCON2), 1, a
#define IDLEIE                           BANKMASK(UIE), 4, a
#define IDLEIF                           BANKMASK(UIR), 4, a
#define IDLEN                            BANKMASK(OSCCON), 7, a
#define INT0                             BANKMASK(PORTC), 0, a
#define INT0E                            BANKMASK(INTCON), 4, a
#define INT0F                            BANKMASK(INTCON), 1, a
#define INT0IE                           BANKMASK(INTCON), 4, a
#define INT0IF                           BANKMASK(INTCON), 1, a
#define INT1                             BANKMASK(PORTC), 1, a
#define INT1E                            BANKMASK(INTCON3), 3, a
#define INT1F                            BANKMASK(INTCON3), 0, a
#define INT1IE                           BANKMASK(INTCON3), 3, a
#define INT1IF                           BANKMASK(INTCON3), 0, a
#define INT1IP                           BANKMASK(INTCON3), 6, a
#define INT1P                            BANKMASK(INTCON3), 6, a
#define INT2                             BANKMASK(PORTC), 2, a
#define INT2E                            BANKMASK(INTCON3), 4, a
#define INT2F                            BANKMASK(INTCON3), 1, a
#define INT2IE                           BANKMASK(INTCON3), 4, a
#define INT2IF                           BANKMASK(INTCON3), 1, a
#define INT2IP                           BANKMASK(INTCON3), 7, a
#define INT2P                            BANKMASK(INTCON3), 7, a
#define INTEDG0                          BANKMASK(INTCON2), 6, a
#define INTEDG1                          BANKMASK(INTCON2), 5, a
#define INTEDG2                          BANKMASK(INTCON2), 4, a
#define INTSRC                           BANKMASK(OSCTUNE), 7, a
#define IOCA0                            BANKMASK(IOCA), 0, a
#define IOCA1                            BANKMASK(IOCA), 1, a
#define IOCA3                            BANKMASK(IOCA), 3, a
#define IOCA4                            BANKMASK(IOCA), 4, a
#define IOCA5                            BANKMASK(IOCA), 5, a
#define IOCB4                            BANKMASK(IOCB), 4, a
#define IOCB5                            BANKMASK(IOCB), 5, a
#define IOCB6                            BANKMASK(IOCB), 6, a
#define IOCB7                            BANKMASK(IOCB), 7, a
#define IOFS                             BANKMASK(OSCCON), 2, a
#define IPEN                             BANKMASK(RCON), 7, a
#define IRCF0                            BANKMASK(OSCCON), 4, a
#define IRCF1                            BANKMASK(OSCCON), 5, a
#define IRCF2                            BANKMASK(OSCCON), 6, a
#define LA4                              BANKMASK(LATA), 4, a
#define LA5                              BANKMASK(LATA), 5, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATB4                            BANKMASK(LATB), 4, a
